<template>
  <div class="c-panel">
    <k-container>
      <k-panel>
        场停线世顾乱诉烧迷境口席德？懂尔灵性声顿排些教缺？遗年味秋险莱复蜖莱遇汽次万被专充笔琴！请奥险一者？黑福妹制案登太站集如说假今友六府角众饭！且杀失含夫宫森律李遍释莱怀都探。像村分招立坦号越顿禁孩赶面受死！浪害儿定关杂们名充问说养窗？回临降富格紶们约袋不著亡多也误孤探道？德录倒力卖佛改段细莫娘顶善杀尽。兵艺光易年值视妈追律何婚！统受英响怕化渐白也般杂宫答众忆曲取最？忽分再欧典犯识哪时晚话？志朋双致。
      </k-panel>
    </k-container>
    <br>
    <k-container flex
                 style="justify-content: space-between">
      <k-container w="1/2"
                   mr="26px">
        <k-panel header="司顶皇顾散理怀奖拍拍探德有">
          场停线世顾乱诉烧迷境口席德？懂尔灵性声顿排些教缺？遗年味秋险莱复蜖莱遇汽次万被专充笔琴！请奥险一者？黑福妹制案登太站集如说假今友六府角众饭！且杀失含夫宫森律李遍释莱怀都探。像村分招立坦号越顿禁孩赶面受死！浪害儿定关杂们名充问说养窗？回临降富格紶们约袋不著亡多也误孤探道？德录倒力卖佛改段细莫娘顶善杀尽。兵艺光易年值视妈追律何婚！统受英响怕化渐白也般杂宫答众忆曲取最？忽分再欧典犯识哪时晚话？志朋双致。
        </k-panel>
      </k-container>
      <k-container w="1/2">
        <k-panel header="司顶皇顾散理怀奖拍拍探德有">
          场停线世顾乱诉烧迷境口席德？懂尔灵性声顿排些教缺？遗年味秋险莱复蜖莱遇汽次万被专充笔琴！请奥险一者？黑福妹制案登太站集如说假今友六府角众饭！且杀失含夫宫森律李遍释莱怀都探。像村分招立坦号越顿禁孩赶面受死！浪害儿定关杂们名充问说养窗？回临降富格紶们约袋不著亡多也误孤探道？德录倒力卖佛改段细莫娘顶善杀尽。兵艺光易年值视妈追律何婚！统受英响怕化渐白也般杂宫答众忆曲取最？忽分再欧典犯识哪时晚话？志朋双致。
          <div class="footer"
               slot="foot">
            <k-button state="primary">确定</k-button>
            <k-button>取消</k-button>
          </div>
        </k-panel>
      </k-container>
    </k-container>
    <br>
    <k-container flex
                 style="justify-content: space-between">
      <k-container w="1/2"
                   mr="26px">
        <k-panel header="司顶皇顾散理怀奖拍拍探德有"
                 background-color="$state-info">
          场停线世顾乱诉烧迷境口席德？懂尔灵性声顿排些教缺？遗年味秋险莱复蜖莱遇汽次万被专充笔琴！请奥险一者？黑福妹制案登太站集如说假今友六府角众饭！且杀失含夫宫森律李遍释莱怀都探。像村分招立坦号越顿禁孩赶面受死！浪害儿定关杂们名充问说养窗？回临降富格紶们约袋不著亡多也误孤探道？德录倒力卖佛改段细莫娘顶善杀尽。兵艺光易年值视妈追律何婚！统受英响怕化渐白也般杂宫答众忆曲取最？忽分再欧典犯识哪时晚话？志朋双致。
        </k-panel>
      </k-container>
      <k-container w="1/2">
        <k-panel header="司顶皇顾散理怀奖拍拍探德有"
                 background-color="$theme-secondary">
          场停线世顾乱诉烧迷境口席德？懂尔灵性声顿排些教缺？遗年味秋险莱复蜖莱遇汽次万被专充笔琴！请奥险一者？黑福妹制案登太站集如说假今友六府角众饭！且杀失含夫宫森律李遍释莱怀都探。像村分招立坦号越顿禁孩赶面受死！浪害儿定关杂们名充问说养窗？回临降富格紶们约袋不著亡多也误孤探道？德录倒力卖佛改段细莫娘顶善杀尽。兵艺光易年值视妈追律何婚！统受英响怕化渐白也般杂宫答众忆曲取最？忽分再欧典犯识哪时晚话？志朋双致。
        </k-panel>
      </k-container>
    </k-container>
  </div>
</template>
